---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.Insert(Autodesk.Revit.DB.Connector)
source: html/dbdf848b-edf9-aba3-20a2-6551296ece13.htm
---
# Autodesk.Revit.DB.ConnectorSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	Connector item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Connector`)